// Query to identify users who have not signed in the past X days
// Utilizes a watchlist to populate UPNs; can be modified to work with IdentityInfo Table

let WatchlistName = (_GetWatchlist('Your Watchlist-Alias') | project UserPrincipalName);
SigninLogs
    | where TimeGenerated > ago (30d)
    | where ResultType == 0
    | where UserPrincipalName in~(WatchlistName)
    | distinct UserPrincipalName
    | join kind = rightanti (WatchlistName
    | extend UserPrincipalName = tolower(UserPrincipalName)
) on UserPrincipalName
