// Summarizes Failed Logins by Locations and displays top 10 results
// Can Be useful to determine failure patterns overtime

SigninLogs
| where TimeGenerated > ago (30d)
| where ConditionalAccessStatus == "failure"
| where (isnotempty(DeviceDetail.trustType) and isnotempty(LocationDetails.countryOrRegion))
| extend Country = tostring(LocationDetails.countryOrRegion),
    State = tostring(LocationDetails.state),
    City = tostring(LocationDetails.city)
| where Country != "US"
| summarize FailedLogins = count() by Country, State, City
| top 10 by FailedLogins
